In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as stats

In [40]:
A=pd.read_table('HR.txt') 
A.head(2)

,Individual,Attrition,Age,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,Ind1,Yes,41,1,1102,1,1,2,1,1,...,1,80,0,8,0,1,6,4,0,5
1,Ind2,No,49,2,279,2,8,1,1,1,...,4,80,1,10,3,3,10,7,1,7

In [39]:
A=pd.read_table('HR.txt',index_col=0) #if not given index column will be coming up refer above so we drop it while reading
A

,Attrition,Age,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
Individual,,,,,,,,,,,,,,,,,,,,,
Ind1,Yes,41,1,1102,1,1,2,1,1,1,...,1,80,0,8,0,1,6,4,0,5
Ind2,No,49,2,279,2,8,1,1,1,2,...,4,80,1,10,3,3,10,7,1,7
Ind3,Yes,37,1,1373,2,2,2,6,1,4,...,2,80,0,7,3,3,0,0,0,0
Ind4,No,33,2,1392,2,3,4,1,1,5,...,3,80,0,8,3,3,8,7,3,0
Ind5,No,27,1,591,2,2,1,2,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Ind1466,No,36,2,884,2,23,2,2,1,2061,...,3,80,1,17,3,3,5,2,0,3
Ind1467,No,39,1,613,2,6,1,2,1,2062,...,1,80,1,9,5,3,7,7,1,7
Ind1468,No,27,1,155,2,4,3,1,1,2064,...,2,80,1,6,0,3,6,2,0,3
Ind1469,No,49,2,1023,1,2,3,2,1,2065,...,4,80,0,17,3,2,9,6,0,8
Ind1470,No,34,1,628,2,8,3,2,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [ ]:
#Q1 Check if there is any significant difference in salaries between Male and Female Employees

In [41]:
A['Gender'].value_counts()

#1 is male and 2 is Female

1    882
2    588
Name: Gender, dtype: int64

In [43]:
df1=A[A['Gender']==1]
df1.shape

(882, 35)

In [44]:
df2=A[A['Gender']==2]
df2.shape

(588, 35)

In [50]:
#Can also be done like this
df=A.groupby('Gender')
df_1=df.get_group(1)
df_2=df.get_group(2)

#Hypothesis

Ho => Average Salary of Male  = Average salary of Female
Ha => Average Salary of Male != Average salary of Female

In [45]:
g1=df1['MonthlyIncome']
g2=df2['MonthlyIncome']

In [46]:
g1.shape

(882,)

In [47]:
g2.shape

(588,)

In [49]:
#Normality test
from scipy.stats import shapiro,ttest_ind,mannwhitneyu

In [51]:
#Shapiro for Group 1
shapiro(df_1['MonthlyIncome'])

(0.8169718384742737, 1.709933327621381e-30)

In [52]:
#Shapiro for Group 2
shapiro(df_2['MonthlyIncome'])

(0.8416616916656494, 9.378564564919968e-24)

In [ ]:
# pvalue <0.05 so we reject the Null hypothesis(Data==Normal is rejected),Ha=> Skewed  is ascepted
# so we use perform mannwhitneyu

In [53]:
mannwhitneyu(df1['MonthlyIncome'],df2['MonthlyIncome'])

MannwhitneyuResult(statistic=245722.5, pvalue=0.044208341633010594)

In [54]:
mannwhitneyu(g1,g2)

MannwhitneyuResult(statistic=245722.5, pvalue=0.044208341633010594)

#Infernece

pval<0.05 we reject the Ho which implies there is a statistical significant difference between Male and Female Salaries.

In [ ]:
# Q1.b. Who's Salary is more Male or Female? as we have found they arent same.

In [55]:
g1.describe()

count      882.000000
mean      6380.507937
std       4714.856577
min       1009.000000
25%       2819.500000
50%       4837.500000
75%       8113.750000
max      19999.000000
Name: MonthlyIncome, dtype: float64

In [56]:
g2.describe()

count      588.000000
mean      6686.566327
std       4695.608507
min       1129.000000
25%       3037.000000
50%       5081.500000
75%       8711.750000
max      19973.000000
Name: MonthlyIncome, dtype: float64

#after we reject Null analysis we do this Post Hoc Analysis- manual thing no spearate functions available

Post Hoc Analysis : Average salary Female salaries is greater than the Male employees.

In [ ]:
#Q2 Check if Salary is one of the reasons for the attrition

In [57]:
A['Attrition'].value_counts()

No     1233
Yes     237
Name: Attrition, dtype: int64

In [58]:
df=A.groupby('Attrition')
df_1=df.get_group('Yes')
df_2=df.get_group('No')
df_1.shape,df_2.shape

((237, 35), (1233, 35))

In [59]:
237/1470 #(total of 237+1233) 237-left 1470-total

0.16122448979591836

In [ ]:
#Shapiro

In [60]:
shapiro(df_1['MonthlyIncome'])

(0.7798969745635986, 1.5025734172664523e-17)

In [61]:
shapiro(df_2['MonthlyIncome'])

(0.8341342210769653, 5.970143412461947e-34)

In [ ]:
#Not normal so we use mannwhitneyu

In [62]:
mannwhitneyu(df_1['MonthlyIncome'],df_2['MonthlyIncome'])

MannwhitneyuResult(statistic=100620.5, pvalue=1.4754154586444366e-14)

pvalue<0.05 so reject the Null hypothesis. Means yesy salary is on the reason for the attrition

Post hoc analysis

In [63]:
df_1['MonthlyIncome'].describe() #who left org

count      237.000000
mean      4787.092827
std       3640.210367
min       1009.000000
25%       2373.000000
50%       3202.000000
75%       5916.000000
max      19859.000000
Name: MonthlyIncome, dtype: float64

In [64]:
df_2['MonthlyIncome'].describe() #whos still in org

count     1233.000000
mean      6832.739659
std       4818.208001
min       1051.000000
25%       3211.000000
50%       5204.000000
75%       8834.000000
max      19999.000000
Name: MonthlyIncome, dtype: float64

Irrespective of overall salary ,Yes the Salary is the reason for attrition because we have seen a significant difference
between one who stays in org and one who left

In [ ]:
# Q3 Check if there is any significant differnce in Age of employees who left and still stays in  org

In [65]:
df=A.groupby('Attrition')
df_1=df.get_group('Yes')
df_2=df.get_group('No')

In [66]:
shapiro(df_1['Age'])

(0.9457082748413086, 1.0054400689796239e-07)

In [67]:
shapiro(df_2['Age'])

(0.9782127737998962, 1.1040232313422327e-12)

In [68]:
mannwhitneyu(df_1['Age'],df_2['Age'])

MannwhitneyuResult(statistic=106859.0, pvalue=2.652171037670851e-11)

Rejects the null hypothesis means there is significant age difference between people who left and stayed in the org

Post hoc analysis

In [69]:
df_1['Age'].describe()

count    237.000000
mean      33.607595
std        9.689350
min       18.000000
25%       28.000000
50%       32.000000
75%       39.000000
max       58.000000
Name: Age, dtype: float64

In [70]:
df_2['Age'].describe()

count    1233.000000
mean       37.561233
std         8.888360
min        18.000000
25%        31.000000
50%        36.000000
75%        43.000000
max        60.000000
Name: Age, dtype: float64

Yes, significant difference in age of people who left.
People who left the org are much younger and less experienced than the ones who are actually staying back.

Case Study 2

In [71]:
df1=pd.read_csv('fair_pay_data.csv')

In [72]:
df1.head()

   employee_id   department        salary new_hire job_level
0            1        Sales  103263.63550       No  Salaried
1            2  Engineering   80708.64104       No    Hourly
2            4  Engineering   60737.04786      Yes    Hourly
3            5  Engineering   99116.32328      Yes  Salaried
4            7  Engineering   51021.64386       No    Hourly

In [ ]:
#Q1
# Check if there is siginificant difference in Salary between finance & Sales department.

In [73]:
g1=df1[df1['department']=='Sales']
g2=df1[df1['department']=='Finance']

In [74]:
g1.head()

    employee_id department        salary new_hire job_level
0             1      Sales  103263.63550       No  Salaried
18           23      Sales   69598.26208       No    Hourly
21           27      Sales   67126.68175       No    Hourly
27           35      Sales   71113.65688      Yes    Hourly
29           38      Sales   67304.80595       No    Hourly

In [75]:
g2.head()

     employee_id department        salary new_hire job_level
79           103    Finance   99313.01630       No  Salaried
100          133    Finance  121074.14780      Yes   Manager
105          140    Finance   88988.78952       No  Salaried
112          148    Finance   62239.79170       No    Hourly
134          177    Finance   67593.16498       No    Hourly

In [ ]:
Ho=> Salary between Finance and Sales is same (No effect)
Ha=> Salary between Finance and Sales is different

In [76]:
from scipy.stats import shapiro,ttest_ind,mannwhitneyu

In [77]:
shapiro(g1['salary'])

(0.9354783296585083, 5.645899329650983e-13)

In [78]:
shapiro(g2['salary'])

(0.9568052887916565, 0.026826908811926842)

In [79]:
#Both pvalues are below 0.05 so we can say its skewed. even if one is below 0.05(95 % threshold ) then we say its skewed 
#and decide to do mannwhitneyu

In [80]:
mannwhitneyu(g1['salary'],g2['salary'])

MannwhitneyuResult(statistic=13333.0, pvalue=0.2563134113862765)

pvalue>0.05 so that means Ho is accepted. Ha is rejected

Inference - Finance and Sales dont have any difference in salary

In [ ]:
Post Hoc analysis.

In [82]:
g1.describe()['salary']

count       446.000000
mean      75039.937578
std       19071.816721
min       46133.673580
25%       60266.171732
50%       71149.549370
75%       85491.681310
max      143105.473800
Name: salary, dtype: float64

In [83]:
g2.describe()['salary']

count        63.000000
mean      76651.664255
std       19529.390615
min       45714.066160
25%       62107.641865
50%       73556.728780
75%       88607.039995
max      127013.215900
Name: salary, dtype: float64

In [ ]:
Inference - Finance salary is marginally higher than the Sales department but mostly same

In [ ]:
# Q2
# Check if there is siginificant difference in Salary between Engineering & Sales department.

In [14]:
df1

      employee_id   department        salary new_hire job_level
0               1        Sales  103263.63550       No  Salaried
1               2  Engineering   80708.64104       No    Hourly
2               4  Engineering   60737.04786      Yes    Hourly
3               5  Engineering   99116.32328      Yes  Salaried
4               7  Engineering   51021.64386       No    Hourly
...           ...          ...           ...      ...       ...
1465         2061  Engineering   49384.53146       No    Hourly
1466         2062  Engineering   78588.46832      Yes    Hourly
1467         2064  Engineering   87528.24317       No  Salaried
1468         2065        Sales   67971.31922       No    Hourly
1469         2068  Engineering   63652.14172       No    Hourly

[1470 rows x 5 columns]

In [ ]:
pd.crosstab(df1[''],df1['']) #cannot be done as its for two columns.. here we need to check for a value inside the column

In [84]:
g1=df1[df1['department']=='Engineering']
g1

      employee_id   department       salary new_hire job_level
1               2  Engineering  80708.64104       No    Hourly
2               4  Engineering  60737.04786      Yes    Hourly
3               5  Engineering  99116.32328      Yes  Salaried
4               7  Engineering  51021.64386       No    Hourly
5               8  Engineering  98399.87194       No  Salaried
...           ...          ...          ...      ...       ...
1463         2057  Engineering  63204.96374      Yes    Hourly
1465         2061  Engineering  49384.53146       No    Hourly
1466         2062  Engineering  78588.46832      Yes    Hourly
1467         2064  Engineering  87528.24317       No  Salaried
1469         2068  Engineering  63652.14172       No    Hourly

[961 rows x 5 columns]

In [85]:
g2=df1[df1['department']=='Sales']
g2

      employee_id department        salary new_hire job_level
0               1      Sales  103263.63550       No  Salaried
18             23      Sales   69598.26208       No    Hourly
21             27      Sales   67126.68175       No    Hourly
27             35      Sales   71113.65688      Yes    Hourly
29             38      Sales   67304.80595       No    Hourly
...           ...        ...           ...      ...       ...
1454         2046      Sales   80524.47338       No    Hourly
1461         2055      Sales   58998.70842       No    Hourly
1462         2056      Sales   91331.25814       No  Salaried
1464         2060      Sales   74188.50073       No    Hourly
1468         2065      Sales   67971.31922       No    Hourly

[446 rows x 5 columns]

In [86]:
shapiro(g1['salary'])

(0.9251603484153748, 1.8634973640013227e-21)

In [87]:
shapiro(g2['salary'])

(0.9354783296585083, 5.645899329650983e-13)

In [ ]:
#Both pvalues are below 0.05 so we can say its skewed. even if one is below 0.05(95 % threshold ) then we say its skewed 
#and decide to do mannwhitneyu

In [88]:
mannwhitneyu(g1['salary'],g2['salary'])

MannwhitneyuResult(statistic=203636.0, pvalue=0.0662754033256594)

0.0662754033256594>0.05 so null hypothesis holds true and Ho is accepted

Inference - Engineering and Sales dont have any difference in salary.  As pvalue is less there could a ver minimal difference between the salary

In [ ]:
# Q3
# Check if there is siginificant difference in Salary between Engineering & Finance department.

In [95]:
df1

      employee_id   department        salary new_hire job_level
0               1        Sales  103263.63550       No  Salaried
1               2  Engineering   80708.64104       No    Hourly
2               4  Engineering   60737.04786      Yes    Hourly
3               5  Engineering   99116.32328      Yes  Salaried
4               7  Engineering   51021.64386       No    Hourly
...           ...          ...           ...      ...       ...
1465         2061  Engineering   49384.53146       No    Hourly
1466         2062  Engineering   78588.46832      Yes    Hourly
1467         2064  Engineering   87528.24317       No  Salaried
1468         2065        Sales   67971.31922       No    Hourly
1469         2068  Engineering   63652.14172       No    Hourly

[1470 rows x 5 columns]

In [96]:
g1=df1[df1['department']=='Finance']
g2=df1[df1['department']=='Engineering']

In [97]:
shapiro(g1['salary'])

(0.9568052887916565, 0.026826908811926842)

In [98]:
shapiro(g2['salary'])

(0.9251603484153748, 1.8634973640013227e-21)

In [99]:
#Both pvalue are below < 0.05 so we use mannwhitenyu

In [100]:
mannwhitneyu(g1['salary'],g2['salary'])

MannwhitneyuResult(statistic=27284.0, pvalue=0.09450630959497097)

0.09450630959497097>0.05 so Null hypothesis holds True. No difference /No effect to say that salary is different for the 
finance and engineering departments

In [101]:
g1.describe().iloc[1,1]

76651.66425492064

In [102]:
g2.describe().iloc[1,1]

73560.73841627462

In [ ]:
#Small change in the salary but minimal so considered as no effect